---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceNormal
source: html/9fc4296b-a0ac-bdf8-1ef3-8e7ff9b00004.htm
---
# Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceNormal Property

The property labeled "Image" from the "AdvancedMetal" schema.

## Syntax (C#)
```csharp
public static string SurfaceNormal { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.